# Пользователь вводит номер буквы в алфавите.

# ссылка на диаграмму https://yapx.ru/v/RyJe7

x = int(input('Введите номер буквы: '))

z = x + 64

print('Вы вызвали букву', chr(z))